// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   HelpStrings.uni
// 
// Abstract:
// 
//   String definitions for command 'help'
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_HELP_UNKNOWN_FLAG #language eng  "help: Unknown flag %hs\n"

#string STR_SHELLENV_HELP_TOO_MANY     #language eng  "Help: Too many parameters\n"

#string STR_SHELLENV_HELP_DUP_FLAG     #language eng  "Help: Duplicated flag - '%hs'.\n"

#string STR_SHELLENV_HELP_VERBOSE_HELP_NOT_FOUND #language eng  "%Hhelp:%N Verbose help for %hs not found!\n"

#string STR_SHELLENV_HELP_UNKNOWN_COMMAND #language eng  "%Hhelp%N: Unknown command '%hs'\n"

#string STR_SHELLENV_HELP_HS           #language eng  "%-.*hs - %s\n"

#string STR_SHELLENV_HELP_ENTER_Q      #language eng  "Press ENTER to continue, 'q' to exit: "

#string STR_SHELLENV_HELP_NO_MATCH     #language eng  "%Hhelp%N: No command matches pattern '%hs'\n"

#string STR_SHELLENV_HELP_TEMPCOLUMN   #language eng  "\r%*a\r"

#string STR_SHELLENV_HELP_USE_DASH_B   #language eng  "\nUse '%Hhelp -b%N' to display commands one screen at a time.\n"

#string STR_SHELLENV_HELP_OLD_SHELL_MODE #language eng  "\n%HNo help for backward compatible mode.\nUse help of enhanced mode instead.%N\n"
